#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import random as rnd

print("=====\nГенератор случайных чисел\n")
# Определение варианта
a = rnd.randint(0, 3)
b = rnd.randint(0, 1)
c = rnd.randint(0, 2)

# Я люблю демократию.
a = 2
b = 0
c = 1

# Описание условий
if a == 0:
    add_a = "изображение с радара"
if a == 1:
    add_a = "изображение с камеры"
if a == 2:
    add_a = "облако точек с лидара"
if a == 3:
    add_a = "облако точек с радара"
    
if b == 0:
    add_b = "частота публикаций сообщений (hz)"
if b == 1:
    add_b = "вывод содержимого сообщений (echo)"

if c == 0:
    add_c = "1 ветка с 5 коммитами"
if c == 1:
    add_c = "2 ветки с 2 коммитами"
if c == 2:
    add_c = "3 ветки с 1 коммитом"

# Вывод сообщений
print(f"Тип сенсора - {a}:\n{add_a}\n")
print(f"Тип выводимых данных - {b}:\n{add_b}\n")
print(f"Вид репозитория - {c}:\n{add_c}")
